{
  "portfolio": {
    "tags": ["svelte", "tailwindcss"],
    "title": "Portfolio",
    "type": "Front-End",
    "description": {
      "pt": "É a página que você está vendo agora.",
      "en": "It's the page you're in right now."
    },
    "repository": "https://github.com/gralmeidan/gralmeidan.github.io/tree/svelte",
    "trybe": false
  },
  "online-store": {
    "tags": ["react", "tailwindcss"],
    "title": "Trybe Online Store",
    "description": {
      "pt": "Esse é um dos projetos que eu desenvolvi na Trybe, consistindo no Front End de uma loja online utilizando-se da API do Mercado Livre para buscar produtos.",
      "en": "This is one of the projects I developed at Trybe. It consists of a fictional online shop. We used Mercado Livre's API to fetch all the products and only developed the front end for the site."
    },
    "repository": "https://github.com/gralmeidan/trybe-onlinestore",
    "href": "https://gralmeidan.github.io/trybe-onlinestore/#/",
    "trybe": true
  },
  "recipesapp": {
    "tags": ["react", "jest", "react-testing-library"],
    "title": "Recipes App",
    "description": {
      "pt": "One of the group projects I developed at Trybe. It consists of a mobile-optimized website that shows various recipes fetched from MealDB and CocktailDB, with tests made with Jest and RTL.",
      "en": "Um dos projetos em grupo que eu desenvolvi na Trybe. Consiste em um website otimizado para telas mobile que mostra várias receitas providas pela MealDB e CocktailDB com testes escritos em Jest e RTL."
    },
    "href": "https://gralmeidan.github.io/trybe-recipes-app",
    "repository": "https://github.com/gralmeidan/trybe-recipes-app",
    "trybe": true
  },
  "notify": {
    "tags": ["react-native", "firebase"],
    "title": "NotIFy",
    "description": {
      "pt": "Esse é o projeto de extensão que eu mencionei. Foi meu primeiro projeto de verdade com programação e por mais que no final o projeto não tenha sido continuado pela instituição, o processo de desenvolvimento foi muito divertido e todos nós ficamos felizes com o resultado.",
      "en": "This is the aforementioned extracurricular project. It was the first actual project I worked on, and although at the time I had a very vague understanding of what I was doing, it was a lot of fun and we were all proud of the end result."
    },
    "repository": "https://github.com/biesseck/app_recados_ifmt_plc",
    "trybe": false
  }
}
