{
  "portfolio": {
    "tags": [
      "svelte",
      "tailwindcss"
    ],
    "title": "Portfolio",
    "type": "Front-End",
    "description": {
      "pt": "É a página que você está vendo agora.",
      "en": "It's the page you're in right now."
    },
    "repository": "https://github.com/gralmeidan/gralmeidan.github.io/tree/svelte",
    "trybe": false
  },
  "busca-agente": {
    "tags": [
      "flutter",
      "nestjs",
      "mysql"
    ],
    "title": "Buscamilhas Agentes",
    "description": {
      "pt": "Um sistema de busca de milhas para agentes de viagens, possibilitando a busca das melhores passagens aéreas com milhas e tarifado em múltiplas companhias aéreas. O projeto foi desenvolvido com Flutter e NestJS, tendo sido lançado para as plataformas Web, Android e iOS.",
      "en": "A flight search system for travel agents, allowing them to find the best airline tickets using loyalty points or standard fares and compare prices across multiple airlines. The project was developed with Flutter and NestJS, and was deployed on Web, Android, and iOS platforms."
    },
    "href": "https://buscamilhas.com/passagens-aereas-com-milhas/",
    "trybe": false
  },
  "backoffice": {
    "tags": [
      "react",
      "nestjs",
      "jest",
      "mysql"
    ],
    "title": "Devnology Backoffice",
    "description": {
      "pt": "Uma ferramenta interna para os times de desenvolvimento da Devnology, permitindo o gerenciamento fácil de configurações e variáveis em múltiplos projetos simultaneamente, com uma interface amigável para as equipes administrativas e de suporte. O projeto foi desenvolvido com React e NestJS, incluindo uma biblioteca de componentes reutilizáveis e uma API performática e escalável para recuperação de dados em grande escala.",
      "en": "An internal tool for Devnology's development teams, enabling easy management of configurations and variables across multiple projects at once, with a user-friendly interface for administrative and support teams. The project was developed with React and NestJS, featuring a reusable component library and a high-performance, scalable API for large-scale data retrieval."
    },
    "trybe": false
  },
  "hackermime": {
    "tags": [
      "typescript"
    ],
    "title": "HackerMime",
    "description": {
      "pt": "Uma ferramenta sofisticada que oferece uma estrutura para contornar sistemas avançados de Anti-Bot com uma taxa de sucesso superior a 90%, demonstrando habilidades avançadas em resolução de problemas, engenharia reversa e análise de segurança.",
      "en": "A sophisticated tool that provides a framework for bypassing advanced anti-bot systems with a success rate above 90%, demonstrating advanced problem-solving, reverse engineering, and security analysis skills."
    },
    "href": "https://devnology.com.br/"
  },
  "rentalcars": {
    "tags": [
      "react",
      "chakraui.png",
      "php",
      "mysql"
    ],
    "title": "Carros 123 Milhas",
    "description": {
      "pt": "Um dos projetos em que eu colaborei enquanto trabalhava na Devnology, consiste em um site de aluguel de carros desenvolvido para a 123milhas em parceria com a Localiza.",
      "en": "One of the projects I collaborated on while working at Devnology, this is a car rental website developed for 123milhas in partnership with Localiza."
    },
    "href": "https://123milhas.com/carros",
    "trybe": false,
    "hidden": true
  },
  "123-app": {
    "tags": [
      "flutter",
      "firebase"
    ],
    "title": "Aplicativo 123 Milhas",
    "description": {
      "pt": "Um aplicativo desenvolvido para a 123milhas através da Devnology, permitindo que os usuários busquem passagens aéreas e reservas de hotéis. O projeto foi desenvolvido com Flutter e Firebase, e está disponível para Android e iOS. Com uma estrutura em módulos reutilizável, para fácil integração em outros projetos.",
      "en": "An app developed for 123milhas through Devnology, allowing users to search for airline tickets and hotel bookings. The project was developed with Flutter and Firebase, and is available for Android and iOS. It features a reusable module structure for easy integration into other projects."
    },
    "href": "https://play.google.com/store/apps/details?id=com.a123milhas.app"
  },
  "whitelabel": {
    "tags": [
      "flutter",
      "nestjs",
      "mysql"
    ],
    "title": "123 WhiteLabel",
    "description": {
      "pt": "O maior projeto que eu desenvolvi na Devnology, se trata de um front-end com branding customizável que apresenta ofertas especiais da 123milhas em passagens aéreas e reservas de hotéis. Tudo construído com uma estrutura de submódulos re-utilizáveis, permitindo sua integração em outros projetos, como o app 123milhas para Android e iOS.",
      "en": "The largest project I developed at Devnology, consisting of a front-end with customizable branding, showcasing special offers from 123milhas for airline tickets and hotel bookings. All built using a structure of reusable submodules, enabling their integration into other projects, such as the 123milhas app for Android and iOS."
    },
    "href": "https://viagens.parceiros.123milhas.com/",
    "trybe": false,
    "hidden": true
  },
  "tfc": {
    "tags": [
      "nodejs",
      "expressjs",
      "sequelize",
      "jsonwebtoken",
      "typescript",
      "docker",
      "mocha",
      "chai"
    ],
    "title": "Trybe Futebol Clube",
    "description": {
      "pt": "O último projeto com foco apenas em Back-End que eu desenvolvi na Trybe, consiste em uma API Rest feita para integrar com um site de listagem de jogos de futebol.",
      "en": "The last Back-End only project I developed at Trybe, consisting of a Restful API made to provide data to a pre-built website that lists football matches."
    },
    "repository": "https://github.com/gralmeidan/tfc",
    "trybe": true,
    "hidden": true
  },
  "blogs-api": {
    "tags": [
      "nodejs",
      "expressjs",
      "sequelize",
      "jsonwebtoken",
      "mysql"
    ],
    "title": "Trybe Blog API",
    "description": {
      "pt": "Um dos projetos desenvolvidos no módulo de Back-End da Trybe, consistiu da implementação de uma API RESTful com endpoints para realização de operações CRUD em um banco de dados relacional.",
      "en": "One of the projects developed in Trybe's Back-End module, it consists of a RESTful API, with endpoints to perform all CRUD operations on a relational database."
    },
    "repository": "https://github.com/gralmeidan/trybe-blog-api",
    "trybe": true,
    "hidden": true
  },
  "recipesapp": {
    "tags": [
      "react",
      "jest",
      "react-testing-library.png"
    ],
    "title": "Recipes App",
    "description": {
      "pt": "Um dos projetos em grupo que eu desenvolvi na Trybe. Consiste em um website otimizado para telas mobile que mostra várias receitas providas pela MealDB e CocktailDB com testes escritos em Jest e RTL.",
      "en": "One of the group projects I developed at Trybe. It consists of a mobile-optimized website that shows various recipes fetched from MealDB and CocktailDB, with tests made with Jest and RTL."
    },
    "href": "https://gralmeidan.github.io/trybe-recipes-app",
    "repository": "https://github.com/gralmeidan/trybe-recipes-app",
    "trybe": true,
    "hidden": true
  },
  "online-store": {
    "tags": [
      "react",
      "tailwindcss"
    ],
    "title": "Trybe Online Store",
    "description": {
      "pt": "Esse é um dos projetos que eu desenvolvi na Trybe, consistindo no Front End de uma loja online utilizando-se da API do Mercado Livre para buscar produtos.",
      "en": "This is one of the projects I developed at Trybe. It consists of a fictional online shop. We used Mercado Livre's API to fetch all the products and only developed the front end for the site."
    },
    "repository": "https://github.com/gralmeidan/trybe-onlinestore",
    "href": "https://gralmeidan.github.io/trybe-onlinestore/#/",
    "trybe": true,
    "hidden": true
  },
  "notify": {
    "tags": [
      "react-native",
      "firebase"
    ],
    "title": "NotIFy",
    "description": {
      "pt": "Esse é o projeto de extensão que eu mencionei. Foi meu primeiro projeto de verdade com programação e por mais que no final o projeto não tenha sido continuado pela instituição, o processo de desenvolvimento foi muito divertido e todos nós ficamos felizes com o resultado.",
      "en": "This is the aforementioned extracurricular project. It was the first actual project I worked on, and although at the time I had a very vague understanding of what I was doing, it was a lot of fun and we were all proud of the end result."
    },
    "repository": "https://github.com/biesseck/app_recados_ifmt_plc",
    "trybe": false
  }
}